export const howToRegisterData = [
    {
        id: 1,
        title: 'Login',
        detail: 'เข้าสู่ระบบได้ 2 ช่องทาง',
        step: [
            'ยืนยันตัวตนด้วยบริการของ Google',
            'ยืนยันตัวตนด้วยบริการของสถาบันฯ',
            'ใช้อีเมล @kmitl.ac.th'
        ],
        image: 'HowToRegister01.png'
    },
    {
        id: 2,
        title: 'Register',
        detail: 'เลือกลงทะเบียนตามช่วงเวลา',
        step: [
            'ลงทะเบียนล่วงหน้า เป็นการขอสิทธิเท่านั้น!',
            'ลงทะเบียนปกติ / เพิ่ม เปลี่ยน ถอน',
        ],
        image: 'HowToRegister02.png'
    },
    {
        id: 3,
        title: 'Register',
        detail: 'แจ้งผลการลงทะเบียนเรียนล่วงหน้า',
        step: [
            'ถ้าได้รับสิทธิ์ ต้องรอยืนยันในวันลงทะเบียนปกติ',
            'ถ้าไม่ได้รับสิทธิ์ ก็ต้องรอคิวต่อไป',
            'หากมีคนสละสิทธิระบบจะทำการเรียกคิวลำดับถัดไป'
        ],
        image: 'HowToRegister03.png'
    },
    {
        id: 4,
        title: 'Register',
        detail: 'การเพิ่มวิชาเรียน',
        step: [
            'กรอกรหัสวิชาและเลือกกลุ่มเรียน (กรณีรหัสวิชานั้นมีมากกว่า 1 กลุ่ม)',
            'กดที่ปุ่ม “เพิ่ม” สีเขียว แล้วกรอกรหัสวิชาที่ต้องการ (ต้องลงรายวิชาให้อยู่ในระหว่างหน่วยกิต 9 ถึง 22)',
            'กดปุ่ม “ดําเนินการต่อ” และ “ยืนยัน”'
        ],
        image: 'HowToRegister04.png'
    },
    {
        id: 5,
        title: 'Register',
        detail: 'การเปลี่ยนวิชาเรียน',
        step: [
            'กดที่ปุ่ม “เปลี่ยน” สีเหลือง',
            'เลือกรายวิชาที่ต้องการเปลี่ยนออกและกรอกรหัสวิชาที่ต้องการเปลี่ยนเขามาแทนที่วิชาที่เลือก',
            'กดปุ่ม “ดําเนินการต่อ” และ “ยืนยัน”'
        ],
        image: 'HowToRegister05.png'
    },
    {
        id: 6,
        title: 'Register',
        detail: 'การถอนรายวิชา',
        step: [
            'กดที่ปุ่ม “ถอน” สีแดง',
            'เลือกรายวิชาที่ต้องการถอนออก',
            'กดปุ่ม “ดําเนินการต่อ + ยืนยัน”'
        ],
        image: 'HowToRegister06.png'
    },
    {
        id: 7,
        title: 'Register',
        detail: 'แสดงรายการของวิชาที่อยู่ในแถวคอย',
        step: [
            'วิชาที่ลงเพิ่มแล้วจํานวนรับเต็ม ระบบจะนําไปเข้าแถวคอยให้อัตโนมัติ (ตารางสีฟ้า)',
            'วิชาที่อยู่ในแถวคอยเมื่อมีที่ว่างเกิดขึ้น ระบบจะเรียกคิวลําดับต่อไป',
            'หากได้รับสิทธิ์รายวิชาจะมีอีเมล แจ้งเตือนไปยังอีเมล(รหัส นักศึกษา@kmitl.ac.th)',
            'วิชาที่ได้สิทธิ์จะย้ายขึ้นไปอยู่ในตารางสีเขียว',
            'กดปุ่ม “เพิ่ม” จากนั้นกรอกรหัสวิชาที่ได้สิทธิ์ เพื่อลงทะเบียน'
        ],
        image: 'HowToRegister07.png'
    },
    {
        id: 8,
        title: 'History',
        detail: 'แสดงแถวคอยย้อนหลัง',
        step: [
            'กดปุ่ม “ดูรายการแถวคอยย้อนหลัง” เพื่อ แสดงรายการแถวคอยย้อนหลัง'
        ],
        image: 'HowToRegister08.png'
    },
    {
        id: 9,
        title: 'History',
        detail: 'ดูประวัติการลงทะเบียนย้อนหลัง',
        step: [
            'กดที่ปุ่ม “ดูประวัติการลงทะเบียน / เพิ่ม / เปลี่ยน / ถอน” เพื่อดูประวัติ'
        ],
        image: 'HowToRegister09.png',
    },
]